
// 1.	*Написати функцію, яка повертає значення гіпотенузи прямокутного трикутника за заданими довжинами його катетів. Використати методи об'єкту Math для обчислення квадратних коренів та піднесення до степеня.
// let katet_first = 6;
// let katet_second = 8;

// function triangle_func(){
//     let katet_first = Math.pow(6, 2);
//     let katet_second = Math.pow(8, 2);
//     let triangle_sum = Math.sqrt(katet_first + katet_second)
//     return (triangle_sum)



// }
// console.log (triangle_func())



// 2.	*Написати функцію, яка випадковим чином повертає число від 0 до 1 з заданою точністю десяткового запису (наприклад, з точністю до 2 знаків після коми). Використати методи об'єкту Math для генерації випадкового числа та округлення значення.

// function mathematical_func(){
// let number;
// return(Math.random(number)).toFixed(2)
// }
// console.log(mathematical_func())

// Методи роботи з масивами:
// 1.	Написати функцію, яка приймає масив чисел та повертає масив тих же чисел, але в зворотному порядку. Використати методи масивів для зміни порядку елементів.
// const arr_letters = [2, 3, 5, 6, 9, 10]

// function show_arr(){
//     arr_letters.reverse()
//     return (arr_letters)



// }
// document.write(show_arr())

// 2.	Написати функцію, яка приймає масив чисел та повертає суму всіх чисел, які є парними. Використати методи масивів для фільтрування елементів та обчислення суми.
